In [2]:
import numpy as np
from IPython.display import display
import pandas as pd

In [5]:
pd_series = pd.Series([10, 100, 15, 35, 35])
print(pd_series)
print(type(pd_series))

np1 = np.array([10, 100, 15, 35, 35])
np1  # no index presented

0     10
1    100
2     15
3     35
4     35
dtype: int64
<class 'pandas.core.series.Series'>

array([ 10, 100,  15,  35,  35])

In [41]:

# create label index
pd_series = pd.Series(data=[1776, 1867, 1821] , index=['USA', 'CANADA', 'MEXICO'])
print(pd_series)
print()

# remove index
# pd_series = pd_series.reset_index(drop=True)
pd_series.reset_index(drop=True, inplace=True)
display(pd_series)
display(pd_series[0])
print()

# restore index
pd_series.index = ["USA", "CANADA", "MEXICO"]
display(pd_series)

print()
display(pd_series.iloc[0])
display('CANADA', pd_series['CANADA'])

print()
display(pd_series.values)
display(pd_series.index)

USA       1776
CANADA    1867
MEXICO    1821
dtype: int64

0    1776
1    1867
2    1821
dtype: int64

1776

USA       1776
CANADA    1867
MEXICO    1821
dtype: int64

1776

'CANADA'

1867

array([1776, 1867, 1821], dtype=int64)

Index(['USA', 'CANADA', 'MEXICO'], dtype='object')

In [46]:
# create label index
pd_series = pd.Series({'USA':1776, 'CANADA': 1867, 'MEXICO': 1823})
print(pd_series)
print()
print(pd_series.keys())
print(pd_series.index)

USA       1776
CANADA    1867
MEXICO    1823
dtype: int64

Index(['USA', 'CANADA', 'MEXICO'], dtype='object')
Index(['USA', 'CANADA', 'MEXICO'], dtype='object')

In [ ]:
# create Series
# store1
# Laptop  3000
# Screen  1000
# Audio    500

# store2
# Screen   300
# Audio    800
# Mouse     50

# create 2 Series for the stores above (1st from list, 2nd from dict)
# print the price of the 'Laptop' from the 1st store use []
# print the price of the 'Audio' from the 2nd store use []
# add the prices (using add function) and print the results

# pd_series = pd.Series(data=[1776, 1867, 1821] , index=['USA', 'CANADA', 'MEXICO']) === list
# pd_series = pd.Series({'USA':1776, 'CANADA': 1867, 'MEXICO': 1823}) === dict

In [58]:
first_series = pd.Series({'Japan': 100, 'China': 450, 'USA': 250})
second_series = pd.Series({'Brazil': 70, 'China': 350, 'USA': 200})

print('\nfirst_series.dtype', first_series.dtype)

concat_series = first_series.add(second_series, fill_value=0)
print('\nconcat_series')
print(concat_series)  # after add the type becomes float

print('\nconcat_series.astype(int)')
print(concat_series.astype(int))

first_series.dtype int64

concat_series
Brazil     70.0
China     800.0
Japan     100.0
USA       450.0
dtype: float64

concat_series.astype(int)
Brazil     70
China     800
Japan     100
USA       450
dtype: int32

In [67]:
np.random.seed(100)
my_data = np.random.randint(0, 101, (4, 3))

# display(pd.DataFrame(my_data))
pd.DataFrame(my_data)

    0   1   2
0   8  24  67
1  87  79  48
2  10  94  52
3  98  53  66

In [99]:
np.random.seed(100)
my_data = np.random.randint(0, 101, (4, 3))
row_index = ['CA', 'NY', 'AZ', 'TX']
col_names = ['Jan', 'Feb', 'Mar']
             
df = pd.DataFrame(my_data, index=my_index, columns=col_names)
display(df)

# index by row name == df.loc
# index by column name = df['column-name']
# index by numeric location == df.iloc
# index and range == df.iloc[ : ]  df.loc[ : ]

display(type(df.loc['AZ']))
print("\n== df.loc['AZ']")
display(df.loc['AZ'])
print()
display(type(df['Jan']))
print()
print("\n== df['Jan']")
display(df['Jan'])
print()

display(df.iloc[0])  # first-row 

print("\n=== df.loc['NY':'AZ']")
display(df.loc['NY':'AZ'])

print("\n=== df.iloc[:3]")  # first 3 rows
display(df.iloc[:3])

print("\n=== df.iloc[::-1]")  # reverse
display(df.iloc[::-1])

    Jan  Feb  Mar
CA    8   24   67
NY   87   79   48
AZ   10   94   52
TX   98   53   66

pandas.core.series.Series

== df.loc['AZ']

Jan    10
Feb    94
Mar    52
Name: AZ, dtype: int32

pandas.core.series.Series

== df['Jan']

CA     8
NY    87
AZ    10
TX    98
Name: Jan, dtype: int32

Jan     8
Feb    24
Mar    67
Name: CA, dtype: int32

=== df.loc['NY':'AZ']

    Jan  Feb  Mar
NY   87   79   48
AZ   10   94   52

=== df.iloc[:3]

    Jan  Feb  Mar
CA    8   24   67
NY   87   79   48
AZ   10   94   52

=== df.iloc[::-1]

    Jan  Feb  Mar
TX   98   53   66
AZ   10   94   52
NY   87   79   48
CA    8   24   67

In [108]:
np.random.seed(100)
my_data = np.random.randint(0, 101, (4, 3))
row_index = ['CA', 'NY', 'AZ', 'TX']
col_names = ['Jan', 'Feb', 'Mar']

df = pd.DataFrame(my_data, index=my_index, columns=col_names)
display(df)

df[['Jan', 'Feb']]  # multi column
# rows AZ to Tx column feb
print("\n== rows AZ to Tx column feb")
display(df.loc['AZ': 'TX']['Feb'])
# rows CA to AZ column Jan, feb
# rows 0..2 column Jan
# *bonus: rows 0..2 column 0..1

    Jan  Feb  Mar
CA    8   24   67
NY   87   79   48
AZ   10   94   52
TX   98   53   66

== rows AZ to Tx column feb

AZ    94
TX    53
Name: Feb, dtype: int32

    Jan  Feb  Mar  a
CA    8   24   67  1
NY   87   79   48  2
AZ   10   94   52  3
TX   98   53   66  4

In [112]:
# C S V
# id, name, age
# 1, danny, 12
# 2, suzi, 30
# 3, moshe, 40

df = pd.read_csv('penguins_size.csv')
df

,species,island,culmen_length_mm,culmen_depth_mm,flipper_length_mm,body_mass_g,sex
0,Adelie,Torgersen,39.1,18.7,181.0,3750.0,MALE
1,Adelie,Torgersen,39.5,17.4,186.0,3800.0,FEMALE
2,Adelie,Torgersen,40.3,18.0,195.0,3250.0,FEMALE
3,Adelie,Torgersen,NaN,NaN,NaN,NaN,NaN
4,Adelie,Torgersen,36.7,19.3,193.0,3450.0,FEMALE
...,...,...,...,...,...,...,...
339,Gentoo,Biscoe,NaN,NaN,NaN,NaN,NaN
340,Gentoo,Biscoe,46.8,14.3,215.0,4850.0,FEMALE
341,Gentoo,Biscoe,50.4,15.7,222.0,5750.0,MALE
342,Gentoo,Biscoe,45.2,14.8,212.0,5200.0,FEMALE
343,Gentoo,Biscoe,49.9,16.1,213.0,5400.0,MALE

In [115]:
df = pd.read_csv('penguins_size.csv')
display(df.columns)
display(df.head())
display(df.tail())

Index(['species', 'island', 'culmen_length_mm', 'culmen_depth_mm',
       'flipper_length_mm', 'body_mass_g', 'sex'],
      dtype='object')

,species,island,culmen_length_mm,culmen_depth_mm,flipper_length_mm,body_mass_g,sex
0,Adelie,Torgersen,39.1,18.7,181.0,3750.0,MALE
1,Adelie,Torgersen,39.5,17.4,186.0,3800.0,FEMALE
2,Adelie,Torgersen,40.3,18.0,195.0,3250.0,FEMALE
3,Adelie,Torgersen,NaN,NaN,NaN,NaN,NaN
4,Adelie,Torgersen,36.7,19.3,193.0,3450.0,FEMALE

,species,island,culmen_length_mm,culmen_depth_mm,flipper_length_mm,body_mass_g,sex
339,Gentoo,Biscoe,NaN,NaN,NaN,NaN,NaN
340,Gentoo,Biscoe,46.8,14.3,215.0,4850.0,FEMALE
341,Gentoo,Biscoe,50.4,15.7,222.0,5750.0,MALE
342,Gentoo,Biscoe,45.2,14.8,212.0,5200.0,FEMALE
343,Gentoo,Biscoe,49.9,16.1,213.0,5400.0,MALE

In [116]:
df = pd.read_csv('penguins_size.csv')
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 344 entries, 0 to 343
Data columns (total 7 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   species            344 non-null    object
 1   island             344 non-null    object
 2   culmen_length_mm   342 non-null    float64
 3   culmen_depth_mm    342 non-null    float64
 4   flipper_length_mm  342 non-null    float64
 5   body_mass_g        342 non-null    float64
 6   sex                334 non-null    object
dtypes: float64(4), object(3)
memory usage: 18.9+ KB

In [118]:
df = pd.read_csv('penguins_size.csv')
df.describe()
df.describe().transpose()

,count,mean,std,min,25%,50%,75%,max
culmen_length_mm,342.0,43.921930,5.459584,32.1,39.225,44.45,48.5,59.6
culmen_depth_mm,342.0,17.151170,1.974793,13.1,15.600,17.30,18.7,21.5
flipper_length_mm,342.0,200.915205,14.061714,172.0,190.000,197.00,213.0,231.0
body_mass_g,342.0,4201.754386,801.954536,2700.0,3550.000,4050.00,4750.0,6300.0

In [128]:
import numpy as np

#      5, 200, 200, 200, 400, 900

#       1  2  3   4   5   6   7   8   9  10
data = [3, 7, 8, 12, 13, 14, 18, 21, 23, 27]  # Sorted data
q1 = np.percentile(data, 25, method="linear")
print(q1) 
q1 = np.percentile(data, 50)
print(q1) 
q1 = np.percentile(data, 75)
print(q1) 

print()

# 9.0
# 13.5
# 20.25

# 3.25 ==> 8 + 0.25 * (12-8) = 8 + 1 = 9 
# 5.5 ==> 13 + 0.5 * (14-13) = 13 + 0.5 = 13.5
# 7.75 ==> 18 + 0.75 * (21-18) = 18 + 2.25 = 20.25

#       1  2  3   4   5   6   7   8   9  10
data = [1, 2, 3, 4]  # Sorted data
q1 = np.percentile(data, 25, method="linear")
print(q1) 
q1 = np.percentile(data, 50)
print(q1) 
q1 = np.percentile(data, 75)
print(q1) 

# (N - 1) X P / 100
# N = number of points
print()
print(3 * 0.25 + 1)
print(3 * 0.5 + 1)
print(3 * 0.75 + 1)

9.0
13.5
20.25


3.25
5.5
7.75

In [129]:
df = pd.read_csv('penguins_size.csv')
df.shape

(344, 7)

In [133]:
df = pd.read_csv('penguins_size.csv')
df.iloc[:10][['island', 'body_mass_g']]
df.head(10)[['island', 'body_mass_g']]

      island  body_mass_g
0  Torgersen       3750.0
1  Torgersen       3800.0
2  Torgersen       3250.0
3  Torgersen          NaN
4  Torgersen       3450.0
5  Torgersen       3650.0
6  Torgersen       3625.0
7  Torgersen       4675.0
8  Torgersen       3475.0
9  Torgersen       4250.0

In [141]:
df = pd.read_csv('penguins_size.csv')
df7 = df.head(7)
df7['my_count'] = [1, 2, 3, 4, 5, 6, 7]  # adding column, must contain the number of rows
df7

C:\Users\User\AppData\Local\Temp\ipykernel_21044\3993852853.py:3: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df7['my_count'] = [1, 2, 3, 4, 5, 6, 7]  # adding column, must contain the number of rows

,species,island,culmen_length_mm,culmen_depth_mm,flipper_length_mm,body_mass_g,sex,my_count
0,Adelie,Torgersen,39.1,18.7,181.0,3750.0,MALE,1
1,Adelie,Torgersen,39.5,17.4,186.0,3800.0,FEMALE,2
2,Adelie,Torgersen,40.3,18.0,195.0,3250.0,FEMALE,3
3,Adelie,Torgersen,NaN,NaN,NaN,NaN,NaN,4
4,Adelie,Torgersen,36.7,19.3,193.0,3450.0,FEMALE,5
5,Adelie,Torgersen,39.3,20.6,190.0,3650.0,MALE,6
6,Adelie,Torgersen,38.9,17.8,181.0,3625.0,FEMALE,7

In [144]:
df = pd.read_csv('penguins_size.csv')
df['culmen_ratio'] = 100 * df['culmen_length_mm'] / df['culmen_depth_mm']
df

,species,island,culmen_length_mm,culmen_depth_mm,flipper_length_mm,body_mass_g,sex,culmen_ratio
0,Adelie,Torgersen,39.1,18.7,181.0,3750.0,MALE,209.090909
1,Adelie,Torgersen,39.5,17.4,186.0,3800.0,FEMALE,227.011494
2,Adelie,Torgersen,40.3,18.0,195.0,3250.0,FEMALE,223.888889
3,Adelie,Torgersen,NaN,NaN,NaN,NaN,NaN,NaN
4,Adelie,Torgersen,36.7,19.3,193.0,3450.0,FEMALE,190.155440
...,...,...,...,...,...,...,...,...
339,Gentoo,Biscoe,NaN,NaN,NaN,NaN,NaN,NaN
340,Gentoo,Biscoe,46.8,14.3,215.0,4850.0,FEMALE,327.272727
341,Gentoo,Biscoe,50.4,15.7,222.0,5750.0,MALE,321.019108
342,Gentoo,Biscoe,45.2,14.8,212.0,5200.0,FEMALE,305.405405
343,Gentoo,Biscoe,49.9,16.1,213.0,5400.0,MALE,309.937888

In [148]:
df = pd.read_csv('penguins_size.csv')
df['culmen_ratio'] = 100 * df['culmen_length_mm'] / df['culmen_depth_mm']

df.drop(0, axis=0, inplace=True)  # drop row
df.drop('culmen_ratio', axis=1, inplace=True)  # drop column
df

# download file tips.csv
# explore the file:
# head, tail, shape, info, describe
# calc 'totel-bill' = 'size' * 'price_per_person'
# calc 'tip perc' = 100 * 'tip' / 'totel-bill'

,species,island,culmen_length_mm,culmen_depth_mm,flipper_length_mm,body_mass_g,sex
1,Adelie,Torgersen,39.5,17.4,186.0,3800.0,FEMALE
2,Adelie,Torgersen,40.3,18.0,195.0,3250.0,FEMALE
3,Adelie,Torgersen,NaN,NaN,NaN,NaN,NaN
4,Adelie,Torgersen,36.7,19.3,193.0,3450.0,FEMALE
5,Adelie,Torgersen,39.3,20.6,190.0,3650.0,MALE
...,...,...,...,...,...,...,...
339,Gentoo,Biscoe,NaN,NaN,NaN,NaN,NaN
340,Gentoo,Biscoe,46.8,14.3,215.0,4850.0,FEMALE
341,Gentoo,Biscoe,50.4,15.7,222.0,5750.0,MALE
342,Gentoo,Biscoe,45.2,14.8,212.0,5200.0,FEMALE
343,Gentoo,Biscoe,49.9,16.1,213.0,5400.0,MALE